# 데이터프레임의 데이터 조작

In [1]:
import numpy as np
import pandas as pd

## 데이터 갯수 세기

In [6]:
# Series
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [4]:
# NaN을 제외한 숫자의 갯수를 셈
s.count()

9

In [8]:
# DF
df = pd.DataFrame(np.arange(16).reshape(4,4), dtype=float)
df.iloc[2, 3] = np.nan
df

      0     1     2     3
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0   NaN
3  12.0  13.0  14.0  15.0

In [11]:
# 각 시리즈별 숫자의 갯수를 셈
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [12]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [14]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [15]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [17]:
titanic.describe().round(1)

       survived  pclass    age  sibsp  parch   fare
count     891.0   891.0  714.0  891.0  891.0  891.0
mean        0.4     2.3   29.7    0.5    0.4   32.2
std         0.5     0.8   14.5    1.1    0.8   49.7
min         0.0     1.0    0.4    0.0    0.0    0.0
25%         0.0     2.0   20.1    0.0    0.0    7.9
50%         0.0     3.0   28.0    0.0    0.0   14.5
75%         1.0     3.0   38.0    1.0    0.0   31.0
max         1.0     3.0   80.0    8.0    6.0  512.3

## 카테고리 값 세기
- series 별 갯수 세기

In [20]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [22]:
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

## 정렬
- 데이터를 정렬하려면 sort_index 메서드 sort_values 메서드를 사용한다.

In [26]:
np.random.seed(2021)
s2 = pd.Series(np.random.randint(1,7, size=100))
s2.tail()

95    2
96    2
97    6
98    1
99    6
dtype: int64

In [27]:
s2.value_counts()

6    21
2    21
3    19
4    18
5    13
1     8
dtype: int64

In [28]:
s2.value_counts().sort_values()

1     8
5    13
4    18
3    19
6    21
2    21
dtype: int64

In [32]:
#내림차순
s2.value_counts().sort_values(ascending=False)

2    21
6    21
3    19
4    18
5    13
1     8
dtype: int64

In [34]:
titanic.sort_values(by='fare', ascending=False).head()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
88          1       1  female  23.0  ...     C  Southampton    yes  False
27          0       1    male  19.0  ...     C  Southampton     no  False

[5 rows x 15 columns]

In [35]:
titanic.sort_values(by=['fare','age'], ascending=False).head()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
679         1       1    male  36.0  ...     B    Cherbourg    yes  False
258         1       1  female  35.0  ...   NaN    Cherbourg    yes   True
737         1       1    male  35.0  ...     B    Cherbourg    yes   True
438         0       1    male  64.0  ...     C  Southampton     no  False
341         1       1  female  24.0  ...     C  Southampton    yes  False

[5 rows x 15 columns]

## 행/열 합계

In [37]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [39]:
# axis=0 가 deafault
df2.sum()

0    19
1    21
2    20
3     5
4    18
5    19
6    16
7    19
dtype: int64

In [40]:
df2.sum(axis=1)

0    43
1    33
2    19
3    42
dtype: int64

In [44]:
df2["RowSum"] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum  ColSum
0  4  5  9  0  6  5  8  6     105      19
1  6  6  6  1  5  7  1  1      87      21
2  5  2  0  3  1  0  2  6      58      20
3  4  8  5  1  6  7  5  6      89       5

In [48]:
df2.loc["ColSum", :] = df2.sum()
df2

           0     1     2     3     4     5     6     7  RowSum
0        4.0   5.0   9.0   0.0   6.0   5.0   8.0   6.0   105.0
1        6.0   6.0   6.0   1.0   5.0   7.0   1.0   1.0    87.0
2        5.0   2.0   0.0   3.0   1.0   0.0   2.0   6.0    58.0
3        4.0   8.0   5.0   1.0   6.0   7.0   5.0   6.0    89.0
ColSum  38.0  42.0  40.0  10.0  36.0  38.0  32.0  38.0   678.0

In [51]:
#타이타닉호 승객의 평균 나이를 구하라.
titanic.age.mean()

29.69911764705882

In [52]:
#타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [53]:
np.round(titanic[titanic.sex == 'female'].age.mean(), 1)

27.9

In [55]:
#타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic[titanic.pclass ==1][titanic.sex == 'female'].head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1          1       1  female  38.0  ...     C    Cherbourg    yes  False
3          1       1  female  35.0  ...     C  Southampton    yes  False
11         1       1  female  58.0  ...     C  Southampton    yes   True
31         1       1  female   NaN  ...     B    Cherbourg    yes  False
52         1       1  female  49.0  ...     D    Cherbourg    yes  False

[5 rows x 15 columns]

In [59]:
# 워닝 막는 방법
import warnings
warnings.filterwarnings('ignore')

In [60]:
np.round(titanic[titanic.pclass ==1][titanic.sex == 'female'].age.mean(), 1)

34.6

## apply 변환

In [73]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [74]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [75]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [76]:
titanic['성년'] = titanic.apply(lambda r: '성년' if r.age>=20 else '미성년', axis=1)
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone   성년 category1
886         0       2    male  27.000000  ...     no   True   성년      male
887         1       1  female  19.000000  ...    yes   True  미성년     child
888         0       3  female  29.699118  ...     no  False   성년     child
889         1       1    male  26.000000  ...    yes   True   성년      male
890         0       3    male  32.000000  ...     no   True   성년      male

[5 rows x 17 columns]

In [77]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age>=20 else 'child', axis=1)
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone   성년 category1
886         0       2    male  27.000000  ...     no   True   성년      male
887         1       1  female  19.000000  ...    yes   True  미성년     child
888         0       3  female  29.699118  ...     no  False   성년    female
889         1       1    male  26.000000  ...    yes   True   성년      male
890         0       3    male  32.000000  ...     no   True   성년      male

[5 rows x 17 columns]

## fillna method

In [67]:
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [71]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 연습문제 4.4.5

In [72]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
titanic.age.fillna(titanic.age.mean(), inplace=True)    # inplace 를 False 에서 True 로 바꿔야 보임
titanic.tail()

     survived  pclass     sex        age  ...  alive  alone   성년 category1
886         0       2    male  27.000000  ...     no   True   성년      male
887         1       1  female  19.000000  ...    yes   True  미성년     child
888         0       3  female  29.699118  ...     no  False  미성년     child
889         1       1    male  26.000000  ...    yes   True   성년      male
890         0       3    male  32.000000  ...     no   True   성년      male

[5 rows x 17 columns]

## astype() 메서드

In [78]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

## 실수 값을 카테고리 값으로 변환
cut: 실수 값의 경계선을 지정하는 경우

qcut: 갯수가 똑같은 구간으로 나누는 경우

In [79]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [80]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]   # 1~20, 20~30, 30~50, 50~70, 70~100 으로 묶임
cats = pd.cut(ages, bins, labels=labels)    #cut에 시리즈(열)을 줄수 있음
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [81]:
cats.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [82]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

### qcut 명령은 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눈다. 예를 들어 다음 코드는 1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가진다.

In [83]:
np.random.seed(2021)
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q4', 'Q3', 'Q2', 'Q1', 'Q3', ..., 'Q3', 'Q1', 'Q4', 'Q2', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [84]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64